# Specifications - Database
Specifically, they want the data from the following files included in your database:

- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres
- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes
- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

# Preliminary Steps

In [1]:
# imports
import pandas as pd

In [2]:
# import title basics csv
title_basics = pd.read_csv("Data/title_basics.csv.gz")

# check
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86960 entries, 0 to 86959
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86960 non-null  object
 1   titleType       86960 non-null  object
 2   primaryTitle    86960 non-null  object
 3   originalTitle   86960 non-null  object
 4   isAdult         86960 non-null  int64
 5   startYear       86960 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86960 non-null  int64
 8   genres          86960 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [3]:
# import title ratings
title_ratings = pd.read_csv("Data/title_ratings.csv.gz")

# check
title_ratings.info()
title_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503723 entries, 0 to 503722
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         503723 non-null  object
 1   averageRating  503723 non-null  float64
 2   numVotes       503723 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000005            6.2      2631
3  tt0000006            5.1       182
4  tt0000007            5.4       824

In [4]:
# import tmdb data
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz")

# check
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2592 entries, 0 to 2591
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2592 non-null   object
 1   adult                  2592 non-null   float64
 2   backdrop_path          1427 non-null   object
 3   belongs_to_collection  209 non-null    object
 4   budget                 2592 non-null   float64
 5   genres                 2592 non-null   object
 6   homepage               171 non-null    object
 7   id                     2592 non-null   float64
 8   original_language      2592 non-null   object
 9   original_title         2592 non-null   object
 10  overview               2546 non-null   object
 11  popularity             2592 non-null   float64
 12  poster_path            2344 non-null   object
 13  production_companies   2592 non-null   object
 14  production_countries   2592 non-null   object
 15  release_date           2570 non-null   object
 16  revenue                2592 non-null   float64
 17  runtime                2592 non-null   float64
 18  spoken_languages       2592 non-null   object
 19  status                 2592 non-null   object
 20  tagline                1113 non-null   object
 21  title                  2592 non-null   object
 22  video                  2592 non-null   float64
 23  vote_average           2592 non-null   float64
 24  vote_count             2592 non-null   float64
 25  certification          811 non-null    object
dtypes: float64(9), object(17)
memory usage: 526.6+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2255.0,PG
4,tt0118852,0.0,/vceiGZ3uavAEHlTA7v0GjQsGVKe.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.804,51.0,R

### Convert the single string of genres from title basics into 2 new tables

In [5]:
# split list of genres into separate columns
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics['genres_split'].head()

0    [Comedy, Fantasy, Romance]
1                       [Drama]
2                       [Drama]
3      [Comedy, Horror, Sci-Fi]
4                       [Drama]
Name: genres_split, dtype: object

In [6]:
# create exploded_genres df
exploded_genres = title_basics.explode('genres_split')

# check
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama

In [7]:
# get list of unique genres from 'genres_split' column
unique_genres = sorted(exploded_genres['genres_split'].unique())

# check
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### Create title_genres dataframe

In [8]:
# create title_genres df with 'tconst' and 'genres_split'
# as columns
title_genres = exploded_genres[['tconst', 'genres_split']].copy()

# check
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### Create genres dataframe

In [9]:
# create genre mapper dictionary (with dict and zip)

# create list of integers, one for each unique genre
genre_ints = range(len(unique_genres))

# create genre mapper: genres to ints
genre_map = dict(zip(unique_genres, genre_ints))

# check
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [10]:
title_genres['genre_id']=title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [11]:
## Manually make df with name col from the key and value
genres=pd.DataFrame({'Genre_Name': genre_map.keys(),
                                                  'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
keepers = ['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']
title_basics = title_basics[keepers]
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [13]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000005            6.2      2631
3  tt0000006            5.1       182
4  tt0000007            5.4       824

In [14]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
keepers = ['imdb_id','budget', 'revenue', 'certification' ]
tmdb_data = tmdb_data[keepers]
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694    150000.0  14204632.0            PG
4  tt0118852         0.0         0.0             R

In [15]:
# # map genre strings to ints in basics in new 'genre_id' column
# title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

# # check
# title_genres.head()

In [16]:
# # drop 'genres_split' column from title_genres
# title_genres.drop(columns = ['genres_split'], inplace = True)

# # check
# 'genres_split' in title_genres.columns

In [17]:
# # use genre_map dictionary keys, values to create table
# genres = pd.DataFrame({'genre_name': genre_map.keys(),
#                       'genre_id': genre_map.values()})

# # check
# genres.head()

# Discard unnecessary information

In [18]:
# # check columns in basics
# title_basics.columns

In [19]:
# # drop unnecessary columns from title_basics (info that stakeholders
# # don't want in the database)

# # desired info: movie id (tconst), primary title, start year,
# # runtime, and genres (which will be a separate table)

# title_basics.drop(columns = ['titleType',
#                             'originalTitle',
#                             'isAdult',
#                             'endYear',
#                             'genres',
#                             'genres_split'], inplace = True)

# # check
# title_basics.info()

In [20]:
# # check columns in tmdb_data
# tmdb_data.columns

In [21]:
# # check difference between 'imdb_id' and 'id' columns
# tmdb_data[['imdb_id', 'id']].head()

In [22]:
# # check how many 'imdb_id' == '0'
# tmdb_data[tmdb_data['imdb_id'] == '0']

In [23]:
# # drop columns with imdb_id as 0
# tmdb_data = tmdb_data[tmdb_data['imdb_id'] != '0']

# # check
# tmdb_data[tmdb_data['imdb_id'] == '0']

In [24]:
# # drop unnecessary columns from tmdb_data (info that 
# # stakeholders don't want in the database)

# # desired info: movie id (tconst), revenue, budget, 
# # certification


# tmdb_data.drop(columns = ['id',
#                          'adult',
#                          'backdrop_path',
#                          'belongs_to_collection',
#                          'genres',
#                          'homepage',
#                          'original_language',
#                          'original_title',
#                          'overview',
#                          'popularity',
#                          'poster_path',
#                          'production_companies',
#                          'production_countries',
#                          'release_date',
#                          'runtime',
#                          'spoken_languages',
#                          'status',
#                          'tagline',
#                          'title',
#                          'video',
#                          'vote_average',
#                          'vote_count'], inplace = True)

# # check
# tmdb_data.info()

# Save tables to MySQL database

In [32]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import database_exists

In [33]:
#create connection string
username='root'
password='root'
db_name='movies'
connection=f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
    
#create an engine
engine=create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [36]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print("The database created!")

NameError: name 'create_database' is not defined

In [ ]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [ ]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# Saving title basics table

In [ ]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

#save to sql with dtype and ic
title_basics.to_sql('title_basics', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

# Saving title ratings table

In [ ]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float()}

#save to sql with dtype and ic
title_ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists = 'replace', index = False)

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

# Saving title genres table

In [ ]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Float()}

#save to sql with dtype and ic
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists = 'replace', index = False)

# Saving tmdb table

In [ ]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Float()}

#save to sql with dtype and ic
tmdb_data.to_sql('tmdb_data', engine, dtype=df_schema, if_exists = 'replace', 
                    index = False)

# Saving genre table

In [ ]:
## Calculate max string lengths for object columns
key_len = genres['Genre_Name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "Genre_Name": String(key_len+1), 
    'Genre_ID':Float()}

#save to sql with dtype and ic
genres.to_sql('genres', engine, dtype=df_schema, if_exists = 'replace', index = False)

# Display first 5 rows of that table using a SQL query

In [ ]:
q = """
SELECT * 
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

In [ ]:
q = """
SELECT * 
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

In [ ]:
q = """
SELECT * 
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

In [ ]:
q = """
SELECT * 
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

In [ ]:
q = """
SELECT * 
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

# Show tables in MySQL

In [ ]:
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)